Part-2:

Here are questions based on the employee_data.csv dataset to test basic data handling skills in pandas:
Question 1: Load the CSV File
Load the CSV file named employee_data.csv as a DataFrame in Python using pandas.
Question 2: View Data
Display the first 5 rows of the DataFrame.
Display the last 5 rows of the DataFrame.
Question 3: DataFrame Summary
Use the describe() function to get the summary statistics of the DataFrame.
Use the info() function to get the basic information about the DataFrame, including the data types and memory usage.
Question 4: Column Selection
Select and print the Salary column of the DataFrame.
Question 5: Conditional Filtering
Filter and display rows where the Age is greater than 30.
Filter and display rows where the Department is 'IT'.

#### Question 1: Load the CSV File

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('customer.csv')

### Question 2: View Data
##### Display the first 5 rows of the DataFrame.
##### Display the last 5 rows of the DataFrame.

In [3]:
df.head(5)

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [4]:
df.tail(5)

    age  gender review education purchased
45   61    Male   Poor        PG       Yes
46   64  Female   Poor        PG        No
47   38  Female   Good        PG       Yes
48   39  Female   Good        UG       Yes
49   25  Female   Good        UG        No

#### Question 3: DataFrame Summary
##### Use the describe() function to get the summary statistics of the DataFrame.
##### Use the info() function to get the basic information about the DataFrame, including the data types and memory usage.

In [5]:
df.describe()

             age
count  50.000000
mean   54.160000
std    25.658161
min    15.000000
25%    30.250000
50%    57.000000
75%    74.000000
max    98.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        50 non-null     int64
 1   gender     50 non-null     object
 2   review     50 non-null     object
 3   education  50 non-null     object
 4   purchased  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

#### Question 4: Column Selection
######  Select and print the Salary column of the DataFrame.

In [7]:
# There is no SALARY column in the data frame.

#### Question 5: Conditional Filtering
###### Filter and display rows where the Age is greater than 30.
###### Filter and display rows where the Department is 'IT'.

In [8]:
df.head()

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [9]:
age_greater_than_30 = df[df['age']>30]

In [43]:
age_greater_than_30.head(5)

   age  gender   review education purchased
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
5   31  Female  Average    School       Yes
7   60  Female     Poor    School       Yes

In [11]:
# Filter and display rows where the Department is 'IT'.

In [12]:
# There are neither department column, nor department name as 'IT'

In [13]:
df.isnull().sum()

age          0
gender       0
review       0
education    0
purchased    0
dtype: int64

In [14]:
df.sample(5)

    age  gender   review education purchased
46   64  Female     Poor        PG        No
21   32    Male  Average        PG        No
10   98  Female     Good        UG       Yes
43   27    Male     Poor        PG        No
15   75    Male     Poor        UG        No

In [15]:
df.nunique()

age          41
gender        2
review        3
education     3
purchased     2
dtype: int64

In [16]:
df.head(5)

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [17]:
df.tail()

    age  gender review education purchased
45   61    Male   Poor        PG       Yes
46   64  Female   Poor        PG        No
47   38  Female   Good        PG       Yes
48   39  Female   Good        UG       Yes
49   25  Female   Good        UG        No

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        50 non-null     int64
 1   gender     50 non-null     object
 2   review     50 non-null     object
 3   education  50 non-null     object
 4   purchased  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [19]:
df.describe()

             age
count  50.000000
mean   54.160000
std    25.658161
min    15.000000
25%    30.250000
50%    57.000000
75%    74.000000
max    98.000000

In [20]:
df.columns

Index(['age', 'gender', 'review', 'education', 'purchased'], dtype='object')

In [21]:
#df.filter[df['Age']>30 & ]

In [22]:
df.memory_usage()

Index        132
age          400
gender       400
review       400
education    400
purchased    400
dtype: int64

In [35]:
df.dropna().head(5)

   age  gender   review education purchased
0   30  Female  Average    School        No
1   68  Female     Poor        UG        No
2   70  Female     Good        PG        No
3   72  Female     Good        PG        No
4   16  Female  Average        UG        No

In [25]:
df.nlargest(5,'age') #filter and order by Age in descending order, limit 5

    age  gender   review education purchased
10   98  Female     Good        UG       Yes
19   97    Male     Poor        PG       Yes
23   96  Female     Good    School        No
37   94    Male  Average        PG       Yes
32   92    Male  Average        UG       Yes

In [27]:
df.dtypes

age           int64
gender       object
review       object
education    object
purchased    object
dtype: object

In [29]:
df.ndim

2

In [30]:
df.shape

(50, 5)

In [31]:
df.size

250

In [33]:
df['gender'].value_counts()

gender
Female    29
Male      21
Name: count, dtype: int64

In [34]:
df['review'].value_counts()

review
Poor       18
Good       18
Average    14
Name: count, dtype: int64

In [36]:
df_numerical = df.select_dtypes(include = 'object')

In [38]:
df_numerical.head()

   gender   review education purchased
0  Female  Average    School        No
1  Female     Poor        UG        No
2  Female     Good        PG        No
3  Female     Good        PG        No
4  Female  Average        UG        No

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        50 non-null     int64
 1   gender     50 non-null     object
 2   review     50 non-null     object
 3   education  50 non-null     object
 4   purchased  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [40]:
df.isnull().sum()

age          0
gender       0
review       0
education    0
purchased    0
dtype: int64

In [42]:
df.index

RangeIndex(start=0, stop=50, step=1)

In [57]:
# [df(['age'] > 30) & (['education'] == 'PG')]
filtered_df = df[ (df['gender']=='Female') & (df['education'] == 'PG')]
filtered_df.count()

age          10
gender       10
review       10
education    10
purchased    10
dtype: int64

In [60]:
df.duplicated().sum()

1

In [80]:
df.dropna().value_counts().sum()

50

In [63]:
df.nunique()

age          41
gender        2
review        3
education     3
purchased     2
dtype: int64

In [64]:
df_filtered=df[['age','gender','review']]

In [66]:
df_filtered.head()

   age  gender   review
0   30  Female  Average
1   68  Female     Poor
2   70  Female     Good
3   72  Female     Good
4   16  Female  Average

In [69]:
df_filter=df[df['age'] > 80] 
df_filter

    age  gender   review education purchased
10   98  Female     Good        UG       Yes
19   97    Male     Poor        PG       Yes
23   96  Female     Good    School        No
29   83  Female  Average        UG       Yes
32   92    Male  Average        UG       Yes
33   89  Female     Good        PG       Yes
34   86    Male  Average    School        No
37   94    Male  Average        PG       Yes

In [70]:
df['age'].head(5)

0    30
1    68
2    70
3    72
4    16
Name: age, dtype: int64

In [71]:
df['gender'].tail(5)

45      Male
46    Female
47    Female
48    Female
49    Female
Name: gender, dtype: object

In [74]:
df.isnull( ).sum()

age          0
gender       0
review       0
education    0
purchased    0
dtype: int64

In [75]:
df['education'].value_counts()

education
PG        18
School    16
UG        16
Name: count, dtype: int64

In [81]:
df['gender'].value_counts()

gender
Female    29
Male      21
Name: count, dtype: int64

In [91]:
# info,describe,head,tail,nunique,filter,dtypes,isnull.sum(),count,sum,value_counts,dropna

In [89]:
# import os 
# chdir

In [99]:
# !pip install sweetviz

In [100]:
# Why SWEETVIZ??? It is extensively used in industry for AUTO EDA (Exploratory Data Analysis)

In [102]:
import sweetviz as sv

In [105]:
# # Analyze the DataFrame
# report = sweetviz(df)

# # Save the report as an HTML file (optional, default filename is SWEETVIZ_REPORT.html)
# report.saveas("my_eda_report.html")

NameError: name 'sweetviz' is not defined